Vimalananth/STM32-EC200-Firmware/src/ota.c
/* ota.c — OTA firmware update state machine (Reliable Stream Mode for EC200U)
 * Final stable version - Direct QHTTPREAD
 */

#include "ota.h"
#include "main.h"
#include "stm32g0xx_hal.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/* External */
extern IWDG_HandleTypeDef hiwdg;

/* Config */
#define OTA_CHUNK_SIZE              256U
#define OTA_STATUS_TOPIC            "pump/01/ota/status"
#define OTA_PROGRESS_EVERY          4096U
#define OTA_CMD_TIMEOUT_MS          120000UL
#define OTA_READ_TIMEOUT_MS         180000UL
#define OTA_SSL_STEP_TIMEOUT_MS     15000UL
#define OTA_HTTPGET_MAX_RETRIES     3U
#define OTA_HTTPGET_RETRY_DELAY_MS  5000UL
#define OTA_HTTPREAD_MAX_RETRIES    2U
#define OTA_STREAM_BUF_SIZE         16384U
#define OTA_STREAM_YIELD_THRESHOLD  14336U

/* States */
typedef enum
{
    OTA_ST_IDLE,
    OTA_ST_SSL_ENABLE,
    OTA_ST_SSL_SECLEVEL,
    OTA_ST_SSL_CACERT,
    OTA_ST_SSL_VERSION,
    OTA_ST_SSL_CIPHER,
    OTA_ST_SSL_CTXID,
    OTA_ST_HTTP_URL_CMD,
    OTA_ST_HTTP_URL_BODY,
    OTA_ST_HTTP_GET,
    OTA_ST_HTTP_READFILE,
    OTA_ST_FLAG_WRITE,
    OTA_ST_REBOOT,
    OTA_ST_ERROR
} OTA_State;

/* Variables */
static OTA_State ota_state = OTA_ST_IDLE;
static char ota_url[256];
static uint32_t ota_file_size = 0;
static uint32_t ota_offset = 0;
static uint32_t ota_crc32 = 0xFFFFFFFFUL;
static uint32_t ota_last_progress = 0;
static uint32_t ota_state_ms = 0;
static uint32_t ota_timeout_ms = 0;

static bool ota_stream_active = false;
static bool ota_stream_rx_complete = false;
static uint32_t ota_stream_remaining = 0;
static uint32_t ota_stream_rx_bytes = 0;
static uint32_t ota_stream_last_rx_ms = 0;
static uint32_t ota_stream_last_dbg_ms = 0;
static bool     ota_stream_dbg_pending = false;
static bool     ota_httpread_stream_started = false;
static bool     ota_httpread_done_urc = false;
static bool     ota_slot_preerased = false;

static uint32_t ota_last_flash_hal_err = 0;
static uint32_t ota_last_flash_page_err = 0xFFFFFFFFUL;
static uint32_t ota_last_flash_sr_before = 0;
static uint32_t ota_last_flash_sr_after = 0;
static uint32_t ota_last_flash_cr_before = 0;
static uint32_t ota_last_flash_cr_after = 0;
static uint8_t  ota_httpget_retries = 0;
static uint8_t  ota_httpread_retries = 0;

/* Buffers */
static uint8_t  ota_bin_buf[OTA_CHUNK_SIZE];
static uint32_t ota_bin_pos = 0;

static uint8_t  ota_stream_buf[OTA_STREAM_BUF_SIZE];
static volatile uint32_t ota_stream_buf_head = 0;
static volatile uint32_t ota_stream_buf_tail = 0;
static volatile uint32_t ota_stream_buf_count = 0;
static uint8_t  ota_flash_dw_buf[8];
static uint8_t  ota_flash_dw_len = 0;
static uint32_t ota_flash_prog_off = 0; /* committed flash bytes in Slot B */
static bool     ota_flash_session_unlocked = false;

/* Callbacks */
static OTA_SendFn ota_send_fn = NULL;
static OTA_PublishFn ota_publish_fn = NULL;

/* Prototypes */
static void ota_stream_buf_reset(void);
static bool ota_stream_buf_push(uint8_t b);
static uint32_t ota_stream_buf_pop_chunk(uint8_t *dst, uint32_t max_len);
static void ota_recover_http_bearer(void);
static void ota_delay_wdg(uint32_t ms);
static void ota_send_qhttpget(void);
static void ota_delete_stale_file(void);
static bool ota_retry_qhttpget(const char *reason);
static void ota_heal_https_ctx(void);
static bool ota_is_exact_reboot_urc(const char *line);
static void flash_clear_sticky_status(void);
static bool ota_flash_flush_pending(void);
static bool ota_preerase_slot_for_size(uint32_t image_size);
static void ota_reset_stream_flash_state(void);
static uint32_t ota_flash_irq_lock(void);
static void ota_flash_irq_unlock(uint32_t primask);
static void ota_flash_lock_ll(void);

#define OTA_RAMFUNC __attribute__((noinline))

/* CRC32 */
static uint32_t crc32_update(uint32_t crc, const uint8_t *data, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int j = 0; j < 8; j++)
            crc = (crc >> 1) ^ (0xEDB88320UL & -(crc & 1));
    }
    return crc;
}

/* Helpers */
static void ota_send(const char *cmd)
{
    if (ota_send_fn) {
        ota_send_fn(cmd);
        ota_send_fn("\r\n");
    }
}

static void ota_publish(const char *payload)
{
    if (ota_publish_fn)
        ota_publish_fn(OTA_STATUS_TOPIC, payload);
}

static void ota_enter(OTA_State s, uint32_t timeout_ms)
{
    ota_state = s;
    ota_state_ms = HAL_GetTick();
    ota_timeout_ms = timeout_ms;
}

static void ota_error(const char *reason)
{
    if (ota_flash_session_unlocked) {
        ota_flash_lock_ll();
        ota_flash_session_unlocked = false;
    }

    ota_stream_active = false;
    ota_stream_rx_complete = false;
    ota_stream_remaining = 0;
    ota_stream_rx_bytes = 0;
    ota_stream_last_rx_ms = 0;
    ota_stream_last_dbg_ms = 0;
    ota_stream_dbg_pending = false;
    ota_httpread_stream_started = false;
    ota_httpread_done_urc = false;
    ota_stream_buf_reset();

    char msg[128];
    snprintf(msg, sizeof(msg), "{\"ota_status\":\"error\",\"reason\":\"%s\"}", reason);
    ota_publish(msg);

    ota_send("AT+QHTTPSTOP");
    ota_enter(OTA_ST_ERROR, 0);

    char dbg[64];
    snprintf(dbg, sizeof(dbg), "[OTA] Error: %s\r\n", reason);
    Debug_Print(dbg);
}

static void ota_delay_wdg(uint32_t ms)
{
    uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < ms) {
        HAL_IWDG_Refresh(&hiwdg);
        HAL_Delay(50);
    }
    HAL_IWDG_Refresh(&hiwdg);
}

static void ota_recover_http_bearer(void)
{
    Debug_Print("[OTA] Strong PDP recovery after 709\r\n");
    ota_send("AT+QIDEACT=1");     ota_delay_wdg(1500);
    ota_send("AT+QIACT=1");       ota_delay_wdg(5000);
    ota_send("AT+QIACT=1");       ota_delay_wdg(2000);
    ota_send("AT+QIDNSCFG=1,\"8.8.8.8\",\"1.1.1.1\""); ota_delay_wdg(300);
    ota_send("AT+QHTTPCFG=\"contextid\",1"); ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"sslctxid\",1");  ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"ssl\",1");       ota_delay_wdg(200);
}

static void ota_delete_stale_file(void)
{
    ota_send("AT+QFDEL=\"UFS:firmware.bin\"");
    ota_delay_wdg(200);
}

