Vimalananth/STM32-EC200-Firmware/src/ota.c
static void ota_send_qhttpget(void)
{
    char cmd[32];
    snprintf(cmd, sizeof(cmd), "AT+QHTTPGET=%lu", (unsigned long)((OTA_CMD_TIMEOUT_MS - 10000UL) / 1000UL));
    ota_send(cmd);
}

/* Retry Functions */
static bool ota_retry_qhttpget(const char *reason)
{
    if (ota_httpget_retries >= OTA_HTTPGET_MAX_RETRIES) return false;
    ota_httpget_retries++;

    /* Hard-reset stream mode before restarting GET.
     * Prevents stale binary path from consuming URCs in state 9. */
    ota_stream_active = false;
    ota_stream_rx_complete = false;
    ota_stream_remaining = 0;
    ota_httpread_stream_started = false;
    ota_httpread_done_urc = false;
    ota_stream_rx_bytes = 0;
    ota_stream_last_rx_ms = 0;
    ota_stream_last_dbg_ms = 0;
    ota_stream_dbg_pending = false;
    ota_stream_buf_reset();

    char dbg[96];
    snprintf(dbg, sizeof(dbg), "[OTA] Retrying QHTTPGET (%u/%u) after %s\r\n", 
             ota_httpget_retries, OTA_HTTPGET_MAX_RETRIES, reason ? reason : "error");
    Debug_Print(dbg);

    ota_send("AT+QHTTPSTOP");
    ota_delay_wdg(OTA_HTTPGET_RETRY_DELAY_MS);

    if (reason && strstr(reason, "709"))
        ota_recover_http_bearer();

    ota_delete_stale_file();
    ota_reset_stream_flash_state();
    ota_slot_preerased = false;
    ota_send_qhttpget();
    ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
    return true;
}

static void ota_heal_https_ctx(void)
{
    Debug_Print("[OTA] Healing HTTPS context for 732 error\r\n");
    ota_send("AT+QSSLCFG=\"ignorelocaltime\",1,1"); ota_delay_wdg(200);
    ota_send("AT+QHTTPCFG=\"ssl\",1");               ota_delay_wdg(200);
}

static bool ota_is_exact_reboot_urc(const char *line)
{
    if (!line || !line[0]) return false;
    return (strcmp(line, "RDY") == 0 || strcmp(line, "+CFUN: 1") == 0);
}

/* Stream Buffer */
static void ota_stream_buf_reset(void)
{
    ota_stream_buf_head = 0U;
    ota_stream_buf_tail = 0U;
    ota_stream_buf_count = 0U;
}

static bool ota_stream_buf_push(uint8_t b)
{
    if (ota_stream_buf_count >= OTA_STREAM_BUF_SIZE)
        return false;
    ota_stream_buf[ota_stream_buf_head] = b;
    ota_stream_buf_head = (ota_stream_buf_head + 1U) & (OTA_STREAM_BUF_SIZE - 1U);
    ota_stream_buf_count++;
    return true;
}

static uint32_t ota_stream_buf_pop_chunk(uint8_t *dst, uint32_t max_len)
{
    uint32_t n = 0;
    while (n < max_len && ota_stream_buf_count > 0U) {
        dst[n++] = ota_stream_buf[ota_stream_buf_tail];
        ota_stream_buf_tail = (ota_stream_buf_tail + 1U) & (OTA_STREAM_BUF_SIZE - 1U);
        ota_stream_buf_count--;
    }
    return n;
}

static OTA_RAMFUNC uint32_t ota_flash_irq_lock(void)
{
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    __DSB();
    __ISB();
    return primask;
}

static OTA_RAMFUNC void ota_flash_irq_unlock(uint32_t primask)
{
    __DSB();
    __ISB();
    if ((primask & 1U) == 0U) {
        __enable_irq();
    }
}

static void flash_clear_sticky_status(void)
{
    /* Clear latched status bits from any previous flash operation so the next
     * erase/program does not fail in FLASH_WaitForLastOperation() pre-check. */
    FLASH->SR = FLASH_SR_CLEAR;
    __DSB();
    __ISB();
}

static OTA_RAMFUNC bool ota_flash_wait_ready(void)
{
    /* With HAL-based erase/program path this is only a light readiness guard. */
    uint32_t guard = 0x000FFFFFUL;
    while (__HAL_FLASH_GET_FLAG(FLASH_FLAG_BSY1) != 0U) {
        IWDG->KR = 0xAAAAU;
        if (--guard == 0U)
            return false;
    }
    return true;
}

static OTA_RAMFUNC bool ota_flash_unlock_ll(void)
{
    if (HAL_FLASH_Unlock() != HAL_OK)
        return false;
    return ((FLASH->CR & FLASH_CR_LOCK) == 0U);
}

static OTA_RAMFUNC void ota_flash_lock_ll(void)
{
    (void)HAL_FLASH_Lock();
}

/* Flash Helpers (HAL path) */
static OTA_RAMFUNC bool flash_erase_page(uint32_t addr)
{
    uint32_t page = (addr - FLASH_BASE) / OTA_PAGE_SIZE;
    FLASH_EraseInitTypeDef er = {
        .TypeErase = FLASH_TYPEERASE_PAGES,
        .Banks = FLASH_BANK_1,
        .Page = page,
        .NbPages = 1};
    uint32_t err = 0xFFFFFFFFUL;
    HAL_StatusTypeDef st;

    if (!ota_flash_wait_ready()) {
        ota_last_flash_hal_err = FLASH_SR_BSY1;
        ota_last_flash_page_err = page;
        return false;
    }

    FLASH->SR = FLASH_SR_CLEAR;
    st = HAL_FLASHEx_Erase(&er, &err);

    ota_last_flash_sr_after = FLASH->SR;
    ota_last_flash_cr_after = FLASH->CR;

    if (st != HAL_OK || err != 0xFFFFFFFFUL) {
        ota_last_flash_hal_err = HAL_FLASH_GetError();
        ota_last_flash_page_err = err;
        return false;
    }

    ota_last_flash_hal_err = 0U;
    ota_last_flash_page_err = 0xFFFFFFFFUL;
    return true;
}

static OTA_RAMFUNC bool flash_write_chunk(uint32_t addr, const uint8_t *buf, uint32_t len)
{
    for (uint32_t i = 0; i + 8 <= len; i += 8) {
        uint64_t dw;
        memcpy(&dw, &buf[i], 8);
        IWDG->KR = 0xAAAAU;
        if (!ota_flash_wait_ready()) {
            ota_last_flash_hal_err = FLASH_SR_BSY1;
            return false;
        }
        FLASH->SR = FLASH_SR_CLEAR;
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + i, dw) != HAL_OK) {
            ota_last_flash_hal_err = HAL_FLASH_GetError();
            return false;
        }
    }
    if (len & 7U) {
        uint8_t pad[8] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
        uint64_t dw;
        memcpy(pad, buf + (len & ~7U), len & 7U);
        memcpy(&dw, pad, 8);
        IWDG->KR = 0xAAAAU;
        if (!ota_flash_wait_ready()) {
            ota_last_flash_hal_err = FLASH_SR_BSY1;
            return false;
        }
        FLASH->SR = FLASH_SR_CLEAR;
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + (len & ~7U), dw) != HAL_OK) {
            ota_last_flash_hal_err = HAL_FLASH_GetError();
            return false;
        }
    }
    return true;
}

static bool ota_flash_append(const uint8_t *buf, uint32_t len)
{
    uint32_t dst = OTA_SLOT_B_ADDR + ota_flash_prog_off;
    uint32_t slot_end = OTA_SLOT_B_ADDR + OTA_SLOT_SIZE;
    uint32_t i = 0;

    if ((ota_offset + len) > OTA_SLOT_SIZE || dst < OTA_SLOT_B_ADDR) {
        Debug_Print("[OTA] Flash bounds guard hit\r\n");
        return false;
    }

    /* CRC is over exact firmware bytes (no padding). */
    ota_crc32 = crc32_update(ota_crc32, buf, len);

    HAL_IWDG_Refresh(&hiwdg);
    if (!ota_flash_session_unlocked) {
        if (!ota_flash_unlock_ll()) {
            Debug_Print("[OTA] Flash unlock failed\r\n");
            return false;
        }
        ota_flash_session_unlocked = true;
    }

