Vimalananth/STM32-EC200-Firmware/src/ota.c
    while (i < len) {
        ota_flash_dw_buf[ota_flash_dw_len++] = buf[i++];
        if (ota_flash_dw_len == 8U) {
            uint32_t prog_addr = OTA_SLOT_B_ADDR + ota_flash_prog_off;
            if ((prog_addr + 8U) > slot_end) {
                ota_flash_lock_ll();
                ota_flash_session_unlocked = false;
                Debug_Print("[OTA] Flash bounds guard hit at program step\r\n");
                return false;
            }
            if (!ota_slot_preerased && (prog_addr % OTA_PAGE_SIZE) == 0U) {
                if (!flash_erase_page(prog_addr)) {
                    ota_flash_lock_ll();
                    ota_flash_session_unlocked = false;
                    Debug_Print("[OTA] Flash erase failed\r\n");
                    return false;
                }
            }
            HAL_IWDG_Refresh(&hiwdg);
            if (!flash_write_chunk(prog_addr, ota_flash_dw_buf, 8U)) {
                ota_flash_lock_ll();
                ota_flash_session_unlocked = false;
                Debug_Print("[OTA] Flash write failed\r\n");
                return false;
            }
            ota_flash_prog_off += 8U;
            ota_flash_dw_len = 0U;
        }
    }

    ota_offset += len;
    HAL_IWDG_Refresh(&hiwdg);

    if (ota_offset - ota_last_progress >= OTA_PROGRESS_EVERY || ota_offset >= ota_file_size) {
        ota_last_progress = ota_offset;
        char msg[96];
        snprintf(msg, sizeof(msg), "{\"ota_status\":\"flashing\",\"progress\":%lu,\"total\":%lu}",
                 (unsigned long)ota_offset, (unsigned long)ota_file_size);
        ota_publish(msg);
    }
    return true;
}

static bool ota_flash_flush_pending(void)
{
    uint32_t slot_end = OTA_SLOT_B_ADDR + OTA_SLOT_SIZE;
    if (ota_flash_dw_len == 0U)
        return true;

    while (ota_flash_dw_len < 8U) {
        ota_flash_dw_buf[ota_flash_dw_len++] = 0xFFU;
    }

    if (!ota_flash_session_unlocked) {
        if (!ota_flash_unlock_ll()) {
            Debug_Print("[OTA] Flash unlock failed (flush)\r\n");
            return false;
        }
        ota_flash_session_unlocked = true;
    }

    {
        uint32_t prog_addr = OTA_SLOT_B_ADDR + ota_flash_prog_off;
        if (!ota_slot_preerased && (prog_addr % OTA_PAGE_SIZE) == 0U) {
            Debug_Print("[OTA] Flash erase page boundary (flush)\r\n");
            if (!flash_erase_page(prog_addr)) {
                ota_flash_lock_ll();
                ota_flash_session_unlocked = false;
                Debug_Print("[OTA] Flash erase failed during flush\r\n");
                return false;
            }
        }
        if ((prog_addr + 8U) > slot_end) {
            ota_flash_lock_ll();
            ota_flash_session_unlocked = false;
            Debug_Print("[OTA] Flash bounds guard hit during flush\r\n");
            return false;
        }
        if (!flash_write_chunk(prog_addr, ota_flash_dw_buf, 8U)) {
            ota_flash_lock_ll();
            ota_flash_session_unlocked = false;
            Debug_Print("[OTA] Flash write failed during flush\r\n");
            return false;
        }
        ota_flash_prog_off += 8U;
    }
    ota_flash_dw_len = 0U;
    return true;
}

static void ota_reset_stream_flash_state(void)
{
    ota_offset = 0;
    ota_crc32 = 0xFFFFFFFFUL;
    ota_last_progress = 0;
    ota_flash_dw_len = 0U;
    ota_flash_prog_off = 0U;
    ota_stream_rx_bytes = 0U;
    ota_stream_last_rx_ms = 0U;
    ota_stream_last_dbg_ms = 0U;
    ota_stream_dbg_pending = false;
    ota_flash_session_unlocked = false;
    ota_stream_buf_reset();
}

static bool ota_preerase_slot_for_size(uint32_t image_size)
{
    uint32_t first_page;
    uint32_t pages;
    uint32_t page_idx;

    if (image_size == 0U || image_size > OTA_SLOT_SIZE) {
        return false;
    }

    first_page = (OTA_SLOT_B_ADDR - FLASH_BASE) / OTA_PAGE_SIZE;
    pages = (image_size + OTA_PAGE_SIZE - 1U) / OTA_PAGE_SIZE;

    Debug_Print("[OTA] Pre-erasing Slot B pages before stream\r\n");

    if (!ota_flash_unlock_ll()) {
        Debug_Print("[OTA] Flash unlock failed (preerase)\r\n");
        return false;
    }

    for (page_idx = 0; page_idx < pages; page_idx++) {
        uint32_t addr = FLASH_BASE + ((first_page + page_idx) * OTA_PAGE_SIZE);
        HAL_IWDG_Refresh(&hiwdg);
        if (!flash_erase_page(addr)) {
            ota_flash_lock_ll();
            Debug_Print("[OTA] Pre-erase failed\r\n");
            return false;
        }
        HAL_IWDG_Refresh(&hiwdg);
    }

    ota_flash_lock_ll();
    ota_slot_preerased = true;
    return true;
}

/* Public API */
void OTA_Init(void)
{
    ota_state = OTA_ST_IDLE;
    ota_stream_active = ota_stream_rx_complete = false;
    ota_stream_remaining = 0;
    ota_stream_rx_bytes = 0;
    ota_stream_last_rx_ms = 0;
    ota_stream_last_dbg_ms = 0;
    ota_stream_dbg_pending = false;
    ota_bin_pos = 0;
    ota_httpread_stream_started = ota_httpread_done_urc = false;
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_flash_dw_len = 0;
    ota_flash_prog_off = 0;
    ota_flash_session_unlocked = false;
    ota_slot_preerased = false;
    ota_stream_buf_reset();
}

bool OTA_IsActive(void) { return ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR; }
bool OTA_BinaryPending(void)
{
    return ota_stream_active && (ota_state == OTA_ST_HTTP_READFILE);
}
bool OTA_ShouldYieldRx(void)
{
    return ota_stream_active &&
           (ota_state == OTA_ST_HTTP_READFILE) &&
           (ota_stream_buf_count >= OTA_STREAM_YIELD_THRESHOLD);
}
bool OTA_ExpectingHttpReadConnect(void)
{
    return (ota_state == OTA_ST_HTTP_READFILE &&
            ota_httpread_stream_started &&
            !ota_stream_active &&
            !ota_stream_rx_complete);
}

void OTA_ForceHttpReadStream(void)
{
    ota_httpread_stream_started = true;
    ota_stream_active = false;
    ota_stream_rx_complete = false;
    ota_stream_remaining = ota_file_size;
    ota_stream_rx_bytes = 0;
    ota_stream_last_rx_ms = HAL_GetTick();
    ota_stream_last_dbg_ms = ota_stream_last_rx_ms;
    ota_stream_dbg_pending = false;
    ota_httpread_done_urc = false;
    ota_stream_buf_reset();
    Debug_Print("[OTA] Armed direct QHTTPREAD stream mode\r\n");
}

void OTA_SetSendFn(OTA_SendFn fn) { ota_send_fn = fn; }
void OTA_SetPublishFn(OTA_PublishFn fn) { ota_publish_fn = fn; }

void OTA_FeedByte(uint8_t b)
{
    if (ota_stream_active)
    {
        uint32_t now = HAL_GetTick();
        ota_state_ms = now;   /* Keep timeout alive during streaming */
        ota_stream_last_rx_ms = now;

        if (!ota_stream_buf_push(b)) {
            ota_stream_active = false;
            ota_error("stream buffer overflow");
            return;
        }

