Vimalananth/STM32-EC200-Firmware/src/ota.c
        ota_stream_rx_bytes++;
        if (ota_stream_remaining > 0) ota_stream_remaining--;
        if (ota_stream_remaining == 0) {
            ota_stream_active = false;
            ota_stream_rx_complete = true;
        }
        if ((now - ota_stream_last_dbg_ms) >= 2000UL) {
            ota_stream_dbg_pending = true;
            ota_stream_last_dbg_ms = now;
        }
        return;
    }
}

/* Start Functions */
void OTA_Start(const char *url)
{
    if (OTA_IsActive()) return;

    strncpy(ota_url, url, sizeof(ota_url)-1);
    ota_url[sizeof(ota_url)-1] = '\0';

    ota_file_size = 0;
    ota_reset_stream_flash_state();
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_slot_preerased = false;
    ota_stream_buf_reset();

    ota_publish("{\"ota_status\":\"starting\"}");

    if (strncmp(ota_url, "https://", 8) == 0) {
        Debug_Print("[OTA] Enabling HTTPS\r\n");
        ota_send("AT+QHTTPCFG=\"ssl\",1");
        ota_enter(OTA_ST_SSL_ENABLE, OTA_SSL_STEP_TIMEOUT_MS);
    } else {
        char cmd[32];
        snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
        ota_send(cmd);
        ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
    }
}

void OTA_StartFromGet(const char *url)
{
    if (OTA_IsActive()) return;

    strncpy(ota_url, url, sizeof(ota_url)-1);
    ota_url[sizeof(ota_url)-1] = '\0';

    ota_file_size = 0;
    ota_reset_stream_flash_state();
    ota_httpget_retries = ota_httpread_retries = 0;
    ota_slot_preerased = false;
    ota_stream_buf_reset();

    ota_publish("{\"ota_status\":\"http_get\"}");
    ota_send_qhttpget();
    ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
}

/* Handle Line */
void OTA_HandleLine(const char *line)
{
    (void)line;

    if (ota_is_exact_reboot_urc(line)) {
        ota_error("modem rebooted during ota");
        return;
    }

    switch (ota_state)
    {
    case OTA_ST_SSL_ENABLE:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"seclevel\",1,1");
            ota_enter(OTA_ST_SSL_SECLEVEL, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL enable failed");
        break;

    case OTA_ST_SSL_SECLEVEL:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"cacert\",1,\"cacert.pem\"");
            ota_enter(OTA_ST_SSL_CACERT, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL seclevel failed");
        break;

    case OTA_ST_SSL_CACERT:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"sslversion\",1,4");
            ota_enter(OTA_ST_SSL_VERSION, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL cacert failed");
        break;

    case OTA_ST_SSL_VERSION:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
            ota_enter(OTA_ST_SSL_CIPHER, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL version failed");
        break;

    case OTA_ST_SSL_CIPHER:
        if (strcmp(line, "OK") == 0) {
            ota_send("AT+QHTTPCFG=\"sslctxid\",1");
            ota_enter(OTA_ST_SSL_CTXID, OTA_SSL_STEP_TIMEOUT_MS);
        } else if (strstr(line, "ERROR")) ota_error("SSL cipher failed");
        break;

    case OTA_ST_SSL_CTXID:
        if (strcmp(line, "OK") == 0) {
            char cmd[32];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPURL=%d,30", (int)strlen(ota_url));
            ota_send(cmd);
            ota_enter(OTA_ST_HTTP_URL_CMD, 10000);
        } else if (strstr(line, "ERROR")) ota_error("SSL ctxid failed");
        break;

    case OTA_ST_HTTP_URL_CMD:
        if (strstr(line, "CONNECT")) {
            if (ota_send_fn) ota_send_fn(ota_url);
            ota_enter(OTA_ST_HTTP_URL_BODY, 10000);
        } else if (strstr(line, "ERROR")) ota_error("QHTTPURL cmd failed");
        break;

    case OTA_ST_HTTP_URL_BODY:
        if (strcmp(line, "OK") == 0) {
            ota_send_qhttpget();
            ota_enter(OTA_ST_HTTP_GET, OTA_CMD_TIMEOUT_MS);
            ota_publish("{\"ota_status\":\"downloading\"}");
        } else if (strstr(line, "ERROR")) ota_error("QHTTPURL body failed");
        break;

    case OTA_ST_HTTP_GET:
        if (strstr(line, "+QHTTPGET:") || strstr(line, "QHTTPGET:"))
        {
            const char *qline = line;

            const char *c = strchr(qline, ':');
            if (c) {
                c++;
                while (*c == ' ') c++;
                if (!strchr(c, ',')) {
                    int qerr = atoi(c);
                    if (qerr != 0) {
                        if (qerr == 709 || qerr == 714 || qerr == 732) {
                            if (qerr == 732) ota_heal_https_ctx();
                            char why[32]; snprintf(why, sizeof(why), "qerr %d", qerr);
                            if (ota_retry_qhttpget(why)) break;
                        }
                        char why[64]; snprintf(why, sizeof(why), "QHTTPGET err %d", qerr);
                        ota_error(why);
                        break;
                    }
                }
            }

            const char *p = strchr(qline, ',');
            int http_code = 0;
            while (p) {
                http_code = atoi(p + 1);
                if (http_code == 200 || http_code == 206) break;
                p = strchr(p + 1, ',');
            }

            if (http_code != 200 && http_code != 206) {
                ota_error("HTTP not 200/206");
                break;
            }

            p = strchr(p + 1, ',');
            if (p) ota_file_size = (uint32_t)atoi(p + 1);

            if (ota_file_size == 0 || ota_file_size > OTA_SLOT_SIZE) {
                ota_error("bad file size");
                break;
            }

            ota_reset_stream_flash_state();
            ota_slot_preerased = false;
            if (!ota_preerase_slot_for_size(ota_file_size)) {
                ota_error("preerase failed");
                break;
            }

