Vimalananth/STM32-EC200-Firmware/src/ota.c
            ota_publish("{\"ota_status\":\"downloading\",\"mode\":\"stream\"}");

            OTA_ForceHttpReadStream();
            ota_delay_wdg(800);

            char cmd[64];
            snprintf(cmd, sizeof(cmd), "AT+QHTTPREAD=%lu", (unsigned long)(OTA_CMD_TIMEOUT_MS / 1000UL));
            ota_send(cmd);

            ota_enter(OTA_ST_HTTP_READFILE, OTA_READ_TIMEOUT_MS);
            Debug_Print("[OTA] Starting direct QHTTPREAD stream\r\n");
        }
        else if (strstr(line, "ERROR") || strstr(line, "+CME"))
        {
            if (!ota_retry_qhttpget("ERROR"))
                ota_error("QHTTPGET failed");
        }
        break;

    case OTA_ST_HTTP_READFILE:
        if (strncmp(line, "CONNECT", 7) == 0 && ota_httpread_stream_started && !ota_stream_active)
        {
            ota_stream_active = true;
            Debug_Print("[OTA] Binary streaming started\r\n");
            break;
        }

        if (strstr(line, "+QHTTPREAD:"))
        {
            int err = -1;
            const char *p = strchr(line, ':');
            if (p) err = atoi(p + 1);

            if (err == 0) {
                ota_httpread_done_urc = true;
                Debug_Print("[OTA] +QHTTPREAD: 0 - download finished\r\n");
            } else {
                if (!ota_retry_qhttpget("QHTTPREAD error"))
                    ota_error("QHTTPREAD failed");
            }
            break;
        }

        if (strstr(line, "ERROR") || strstr(line, "+CME"))
        {
            if (!ota_retry_qhttpget("ERROR"))
                ota_error("QHTTPREAD failed");
        }
        break;

    default:
        break;
    }
}

/* Process */
void OTA_Process(void)
{
    /* Do not print periodic stream progress here.
     * Debug_Print is blocking on USART2 and can starve USART1 RX,
     * causing deterministic tail-byte loss during QHTTPREAD. */
    ota_stream_dbg_pending = false;

    /* Important: do not monopolize CPU here.
     * Drain only one small slice per loop so Modem_Process() keeps servicing
     * USART1 RX and the stream tail is not dropped. */
    if (ota_stream_buf_count > 0U)
    {
        uint32_t n;
        /* Keep flash work per loop tiny so UART RX service cadence stays high
         * throughout QHTTPREAD tail; this avoids deterministic late-byte loss. */
        uint32_t max_n = 8U;
        n = ota_stream_buf_pop_chunk(ota_bin_buf, max_n);
        if (n > 0U) {
            if (!ota_flash_append(ota_bin_buf, n)) {
                ota_error("flash write failed");
                return;
            }
        }
    }

    if (ota_stream_rx_complete && ota_stream_buf_count == 0 && ota_state == OTA_ST_HTTP_READFILE)
    {
        ota_stream_rx_complete = false;
        /* Wait for +QHTTPREAD: 0 URC before finalizing. Timeout path handles
         * cases where the URC never arrives. */
    }

    if (ota_state == OTA_ST_HTTP_READFILE &&
        ota_httpread_done_urc &&
        !ota_stream_active &&
        ota_stream_buf_count == 0)
    {
        if (ota_offset != ota_file_size) {
            ota_error("download size mismatch");
            return;
        }
        if (!ota_flash_flush_pending()) {
            ota_error("flash write failed");
            return;
        }
        ota_enter(OTA_ST_FLAG_WRITE, 0);
    }

    if (ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR)
        HAL_IWDG_Refresh(&hiwdg);

    if (ota_state != OTA_ST_IDLE && ota_state != OTA_ST_ERROR && ota_timeout_ms > 0)
    {
        if (HAL_GetTick() - ota_state_ms > ota_timeout_ms)
        {
            if (ota_state == OTA_ST_HTTP_READFILE) {
                if (ota_stream_active) {
                    uint32_t since_rx = HAL_GetTick() - ota_stream_last_rx_ms;
                    if (since_rx < 10000UL) {
                        ota_state_ms = HAL_GetTick();
                        return;
                    }
                    {
                        char dbg[140];
                        snprintf(dbg, sizeof(dbg),
                                 "[OTA] Stream stalled at %lu/%lu (%lums), buf=%lu, restarting GET\r\n",
                                 (unsigned long)ota_stream_rx_bytes,
                                 (unsigned long)ota_file_size,
                                 (unsigned long)since_rx,
                                 (unsigned long)ota_stream_buf_count);
                        Debug_Print(dbg);
                    }
                }
                if (!ota_retry_qhttpget("stream timeout")) {
                    ota_error("state timeout");
                }
            } else if (ota_state == OTA_ST_HTTP_GET) {
                if (!ota_retry_qhttpget("http get TO")) {
                    ota_error("state timeout");
                }
            } else {
                ota_error("state timeout");
            }
        }
    }

    switch (ota_state)
    {
    case OTA_ST_FLAG_WRITE:
    {
        Debug_Print("[OTA] Enter OTA_ST_FLAG_WRITE\r\n");
        HAL_IWDG_Refresh(&hiwdg);
        if (ota_flash_session_unlocked) {
            ota_flash_lock_ll();
            ota_flash_session_unlocked = false;
        }
        uint32_t final_crc = ota_crc32 ^ 0xFFFFFFFFUL;

        FLASH_EraseInitTypeDef er = {
            .TypeErase = FLASH_TYPEERASE_PAGES,
            .Banks = FLASH_BANK_1,
            .Page = (OTA_FLAGS_ADDR - FLASH_BASE) / OTA_PAGE_SIZE,
            .NbPages = 1
        };
        uint32_t err;
        HAL_FLASH_Unlock();
        HAL_IWDG_Refresh(&hiwdg);
        if (HAL_FLASHEx_Erase(&er, &err) != HAL_OK || err != 0xFFFFFFFFUL) {
            HAL_FLASH_Lock();
            ota_error("flags erase failed");
            break;
        }

        uint64_t word0, word1;
        uint32_t w0[2] = {OTA_MAGIC, ota_file_size};
        uint32_t w1[2] = {final_crc, 0xFFFFFFFFUL};
        memcpy(&word0, w0, 8);
        memcpy(&word1, w1, 8);

        bool ok = (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR, word0) == HAL_OK) &&
                  (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, OTA_FLAGS_ADDR + 8, word1) == HAL_OK);

        HAL_FLASH_Lock();
        HAL_IWDG_Refresh(&hiwdg);

        if (!ok) {
            ota_error("flags write failed");
            break;
        }

        ota_publish("{\"ota_status\":\"rebooting\"}");
        Debug_Print("[OTA] Flags written OK, entering OTA_ST_REBOOT\r\n");
        ota_enter(OTA_ST_REBOOT, 1000);
        break;
    }

    case OTA_ST_REBOOT:
        HAL_IWDG_Refresh(&hiwdg);
        if (HAL_GetTick() - ota_state_ms >= 1000)
        {
            Debug_Print("[OTA] OTA_ST_REBOOT: QHTTPSTOP + QIDEACT + reset\r\n");
            ota_send("AT+QHTTPSTOP");
            ota_delay_wdg(3000);
            ota_send("AT+QIDEACT=1");
            ota_delay_wdg(5000);
            HAL_IWDG_Refresh(&hiwdg);
            NVIC_SystemReset();
        }
        break;

    default:
        break;
    }
}
